example-cases/pipe/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2306                                  |
|   \  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

scale 1.0;
// number of elements in inner square's edge
nSquare 20;
// number of elements between circle and inner square
nCircle 30;
grading 0.05;

vertices
(

//square(z_in)
(0.45 -0.45 0.0) //point 0
(-0.45 -0.45 0.0) //point 1
(-0.45 0.45 0.0) //point 2
(0.45 0.45 0.0) //point 3

//circle(z_in)
(0.7146742789779407 -0.6994592009764626 0.0) //point 4
(-0.7146742789779407 -0.6994592009764626 0.0) //point 5
(-0.7146742789779407 0.6994592009764626 0.0) //point 6
(0.7146742789779407 0.6994592009764626 0.0) //point 7

//square(z_out)
(0.45 -0.45 0.1) //point 8
(-0.45 -0.45 0.1) //point 9
(-0.45 0.45 0.1) //point 10
(0.45 0.45 0.1) //point 11

//circle(z_out)
(0.7146742789779407 -0.6994592009764626 0.1) //point 12
(-0.7146742789779407 -0.6994592009764626 0.1) //point 13
(-0.7146742789779407 0.6994592009764626 0.1) //point 14
(0.7146742789779407 0.6994592009764626 0.1) //point 15

);

blocks
(

//block 0
hex (1 0 3 2 9 8 11 10) square ($nSquare $nSquare 1) simpleGrading (1 1 1)

//block1
hex (0 4 7 3 8 12 15 11) innerCircle ($nCircle $nSquare 1) simpleGrading ($grading 1 1)

//block2
hex (3 7 6 2 11 15 14 10) innerCircle ($nCircle $nSquare 1) simpleGrading ($grading 1 1)

//block3
hex (2 6 5 1 10 14 13 9) innerCircle ($nCircle $nSquare 1) simpleGrading ($grading 1 1)

//block4
hex (1 5 4 0 9 13 12 8) innerCircle ($nCircle $nSquare 1) simpleGrading ($grading 1 1)

);

edges
(

//Circle edges
arc 7 4 (1 0 0.0) 
arc 4 5 (0 -1 0.0) 
arc 5 6 (-1 0 0.0) 
arc 6 7 (0 1 0.0) 
arc 15 12 (1 0 0.1) 
arc 12 13 (0 -1 0.1) 
arc 13 14 (-1 0 0.1) 
arc 14 15 (0 1 0.1) 

//Square edges
arc 3 0 (0.54 0 0.0)
arc 0 1 (0.0 -0.54 0.0)
arc 1 2 (-0.54 0.0 0.0)
arc 2 3 (0.0 0.54 0.0)
arc 11 8 (0.54 0 0.1)
arc 8 9 (0.0 -0.54 0.1)
arc 9 10 (-0.54 0.0 0.1)
arc 10 11 (0.0 0.54 0.1)

);

boundary
(
    walls
    {
        type wall;
        faces
        (
        (4 7 15 12)
        (5 4 12 13)
        (6 5 13 14)
        (7 6 14 15)
        );

    }
    inlet
    {
        type cyclic;
		neighbourPatch outlet;
        faces
        (
        (3 0 1 2)
        (3 7 4 0)
        (2 6 7 3)
        (1 5 6 2)
        (0 4 5 1)
        );

    }
    outlet
    {
        type cyclic;
		neighbourPatch inlet;
        faces
        (
        (11 10 9 8)
        (11 8 12 15)
        (10 11 15 14)
        (9 10 14 13)
        (8 9 13 12)
        );

    }
);

mergePatchPairs
(
);

