example-cases/pipe/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       5560;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          2800;
        startFace       5640;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          2800;
        startFace       8440;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
)

// ************************************************************************* //
