example-cases/pipe/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          epsilon;
}

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0000111803; 

boundaryField
{
    "(inlet|outlet)"
    {
        type        cyclic;
    }
    walls
    {
        type 		fixedValue;
		value		uniform 1e-10;
    }
}


// ************************************************************************* //
