example-cases/pipe/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          fvSolution;
}

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          1e-2;
		maxIter			5;
    }
    "(U|k|epsilon|f|zeta|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          1e-3;
    }
}

SIMPLE
{
	nNonOrthogonalCorrectors 0;
    consistent      yes;
    pRefValue       0;
	pRefCell		0;
    residualControl
    {
		Uz              			1e-6;
        "(k|epsilon|f|omega|zeta)" 	1e-6; 
    }
}

relaxationFactors
{
    fields
    {
        p               			0.8;
    }
    equations
    {
        U               			0.8;
        "(k|epsilon|f|omega|zeta)" 	0.8;
    }
}


// ************************************************************************* //
